<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
    <h2>EXP 2</h2>
    <h2>Date:23/07/2024</h2>
    <h2>Reg No:URK22CS5090</h2><br>
    <center><h1>Working with Data using Pandas</h1></center>
    <h4>Aim</h4>
    <p>Write a python program to work with data such as selection, filtering, filtering missing
values, deletion, sorting and grouping using Pandas for data science application.</p>
    <h4>Description</h4>
    <p>Python Pandas is defined as an open-source library that provides high-performance datamanipulation in Python. Started by Wes McKinney in 2008 out of a need for a powerful and
flexible quantitative analysis tool, panda has grown into one of the most popular Pythonlibraries. Pandas is built on top of the Numpy package, means Numpy is required for
operating the Pandas.

<b>Key Features of Pandas:</b><br>

It has a fast and efficient DataFrame object with the default and customized indexing.
Used for reshaping and pivoting of the data sets.
Group by data for aggregations and transformations.
It is used for data alignment and integration of the missing data.
Provide the functionality of Time Series.
Process a variety of data sets in different formats like matrix data, tabular
heterogeneous, time series.
Handle multiple operations of the data sets such as subsetting, slicing, filtering,
groupBy, re-ordering, and re-shaping.
It integrates with the other libraries such as SciPy, and scikit-learn.
Python Pandas Data Structure
The Pandas provides two data structures for processing the data, i.e., Series and
DataFrame.</p>
</body>
</html>

In [9]:
import pandas as pd
import numpy as np
df=pd.read_csv("Employees 2.csv")

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <h2>Questions</h2>
    <b><p>1.Display the columns that have null and its count</p></b>
</body>
</html>

In [10]:
null_counts = df.isnull().sum()
null_columns = null_counts[null_counts > 0]
print(null_columns)

First_Name            69
Gender               148
Salary                 2
Bonus                  3
Senior_Management     68
Age                  192
dtype: int64

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>2.Display the statistical description of the numerical and non-numerical columns</p></b>
</body>
</html>

In [11]:
numerical_description = df.describe()
non_numerical_description = df.describe(include=[object])
print(numerical_description)
print(non_numerical_description)

              Age
count  808.000000
mean    29.818280
std     14.562117
min      0.420000
25%     20.875000
50%     28.000000
75%     39.000000
max     80.000000
       First_Name  Gender  Salary   Bonus Senior_Management             Team
count         931     852     998     997               932             1000
unique        201       3     993     968                 4               10
top       Marilyn  Female  121160  12.182              TRUE  Client Services
freq           11     428       2       3               467              111

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>3.Display the rows that ‘Team’ column value is Marketing and observe the count</p></b>
</body>
</html>

In [12]:
marketing_team = df[df['Team'] == 'Marketing']
print(marketing_team)
print("Count:", marketing_team.shape[0])

    First_Name  Gender  Salary   Bonus Senior_Management       Team   Age
0      Douglas    Male   97308   6.945              TRUE  Marketing  22.0
1       Thomas    Male   61933     NaN              TRUE  Marketing  38.0
21     Matthew    Male  100612  13.645             FALSE  Marketing  34.0
26       Craig    Male   37598   7.757              TRUE  Marketing   NaN
43     Marilyn  Female   73524   5.207              TRUE  Marketing   3.0
..         ...     ...     ...     ...               ...        ...   ...
942       Lori  Female   75498   6.537              TRUE  Marketing  44.0
947        NaN    Male  107351   5.329               NaN  Marketing   NaN
986      Donna  Female   82871  17.999             FALSE  Marketing  44.0
991       Rose  Female  134505  11.051              TRUE  Marketing   NaN
994     George    Male   98874   4.479              TRUE  Marketing  48.0

[105 rows x 7 columns]
Count: 105

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>4.Display the First Name and Team of first 25 rows with ‘Senior_Management’ column
is TRUE</p></b>
</body>
</html>

In [13]:
senior_management = df[df['Senior_Management'] == True][['First_Name', 'Team']].head(25)
print(senior_management)

Empty DataFrame
Columns: [First_Name, Team]
Index: []

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>5.Display the rows that Salary>10000 and Gender status is Male</p></b>
</body>
</html>

In [14]:
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')
high_salary_males = df[(df['Salary'] > 10000) & (df['Gender'] == 'Male')]
print(high_salary_males)

    First_Name Gender    Salary   Bonus Senior_Management  \
0      Douglas   Male   97308.0   6.945              TRUE
1       Thomas   Male   61933.0     NaN              TRUE
4        Larry   Male  101004.0   1.389              TRUE
12     Brandon   Male  112807.0  17.492              TRUE
13        Gary   Male  109831.0   5.831             FALSE
..         ...    ...       ...     ...               ...
994     George   Male   98874.0   4.479              TRUE
996    Phillip   Male   42392.0  19.675             FALSE
997    Russell   Male   96914.0   1.421             FALSE
998      Larry   Male   60500.0  11.985             FALSE
999     Albert   Male  129949.0  10.169              TRUE

                     Team   Age
0               Marketing  22.0
1               Marketing  38.0
4         Client Services  35.0
12        Human Resources  20.0
13                  Sales  39.0
..                    ...   ...
994             Marketing  48.0
996               Finance  24.0
997               Product  42.0
998  Business Development  27.0
999                 Sales  31.0

[421 rows x 7 columns]

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>6.Display the top 10 rows of the ‘First_Name’ column with NAN value</p></b>
</body>
</html>

In [15]:
first_name_nan = df[df['First_Name'].isnull()].head(10)
print(first_name_nan)

    First_Name  Gender    Salary   Bonus Senior_Management             Team  \
7          NaN  Female   45906.0  11.598               NaN          Finance
23         NaN    Male  125792.0   5.042               NaN  Client Services
25         NaN    Male   37076.0  18.576               NaN  Client Services
32         NaN    Male  122340.0   6.417               NaN          Product
39         NaN    Male  122173.0   7.797               NaN  Client Services
51         NaN     NaN   41126.0  14.009               NaN            Sales
62         NaN  Female   58112.0  19.414               NaN        Marketing
79         NaN  Female  115814.0    4.99             FALSE          Product
116        NaN    Male   76189.0  18.988               NaN            Legal
139        NaN  Female  132373.0  10.527               NaN      Engineering

      Age
7     2.0
23   28.0
25   38.0
32    NaN
39   14.0
51   21.0
62   45.0
79   30.0
116  70.5
139  24.0


<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>7.Display the max value in ‘Age’, min value in ‘Age’, and mean value in ‘Age’</p></b>
</body>
</html>

In [16]:
max_age = df['Age'].max()
min_age = df['Age'].min()
mean_age = df['Age'].mean()
print(f"Max Age: {max_age}, Min Age: {min_age}, Mean Age: {mean_age}")

Max Age: 80.0, Min Age: 0.42, Mean Age: 29.818279702970294


<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>8.Display unique values in the Team column</p></b>
</body>
</html>

In [17]:
unique_teams = df['Team'].unique()
print(unique_teams)

['Marketing' 'Finance' 'Client Services' 'Legal' 'Product' 'Engineering'
 'Business Development' 'Human Resources' 'Sales' 'Distribution']


<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>9.Update the data frame with new column ‘New_Age’. New_Age = Age + 10 and observe
the size of the data frame</p></b>
</body>
</html>

In [18]:
df['New_Age'] = df['Age'] + 10
print(df.shape)

(1000, 8)

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>10. Drop the New_Age column permanently and observe the size of the data frame</p></b>
</body>
</html>

In [19]:
df.drop(columns=['New_Age'], inplace=True)
print(df.shape)

(1000, 7)

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>11. Drop the rows with NAN and observe the size of the data frame</p></b>
</body>
</html>

In [20]:
df_dropped_nans = df.dropna()
print(df_dropped_nans.shape)

(635, 7)

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>12. Append two new rows in the data frame and observe the size of the data frame</p></b>
</body>
</html>

In [21]:
import pandas as pd
df = pd.DataFrame({
    'First_Name': ['John', 'Jane', 'Jim'],
    'Team': ['Sales', 'HR', 'IT'],
    'Age': [28, 34, 45],
    'Senior_Management': [False, True, False],
    'Salary': [5000, 6000, 7000],
    'Gender': ['Male', 'Female', 'Male'],
    'Bonus': [500, 600, 700]
})
print("Original size of the DataFrame:", df.shape)
new_rows = pd.DataFrame({
    'First_Name': ['New1', 'New2'],
    'Team': ['Team1', 'Team2'],
    'Age': [30, 40],
    'Senior_Management': [False, True],
    'Salary': [7000, 8000],
    'Gender': ['Male', 'Female'],
    'Bonus': [1000, 2000]
})
df = pd.concat([df, new_rows], ignore_index=True)
print("New size of the DataFrame:", df.shape)
print(df)

Original size of the DataFrame: (3, 7)
New size of the DataFrame: (5, 7)
  First_Name   Team  Age  Senior_Management  Salary  Gender  Bonus
0       John  Sales   28              False    5000    Male    500
1       Jane     HR   34               True    6000  Female    600
2        Jim     IT   45              False    7000    Male    700
3       New1  Team1   30              False    7000    Male   1000
4       New2  Team2   40               True    8000  Female   2000

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>13. Fill the NAN values in ‘First Name’ column with ‘Samson’ and observe the null values
count</p></b>
</body>
</html>

In [22]:
print("Null values count before filling:")
print(df.isnull().sum())
df['First_Name'] = df['First_Name'].fillna('Samson')
print("Null values count after filling:")
print(df.isnull().sum())

Null values count before filling:
First_Name           0
Team                 0
Age                  0
Senior_Management    0
Salary               0
Gender               0
Bonus                0
dtype: int64
Null values count after filling:
First_Name           0
Team                 0
Age                  0
Senior_Management    0
Salary               0
Gender               0
Bonus                0
dtype: int64

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>14. Group the rows based on the ‘Team’ column and observe how many are in each
category</p></b>
</body>
</html>

In [23]:
team_groups = df.groupby('Team').size()
print(team_groups)

Team
HR       1
IT       1
Sales    1
Team1    1
Team2    1
dtype: int64

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <b><p>15. Sort the data frame based on ‘Bonus’</p></b>
</body>
</html>

In [24]:
df_sorted_by_bonus = df.sort_values(by='Bonus')
print(df_sorted_by_bonus)

  First_Name   Team  Age  Senior_Management  Salary  Gender  Bonus
0       John  Sales   28              False    5000    Male    500
1       Jane     HR   34               True    6000  Female    600
2        Jim     IT   45              False    7000    Male    700
3       New1  Team1   30              False    7000    Male   1000
4       New2  Team2   40               True    8000  Female   2000

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

</head>
<body>
    <h3>Result:</h3>
    <p>Thus Working with Data using Pandas has been Executed Sucessfully</p>
</body>
</html>